---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SiteFailures.CannotIntersectSiteRegions
source: html/686f10cc-c058-8ca0-ed8f-7ed3fb76bff5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SiteFailures.CannotIntersectSiteRegions Property

Subregions cannot intersect.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotIntersectSiteRegions { get; }
```